Revit 2027 API
Transform.OfPoint Method
Applies the transformation to the point and returns the result.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ OfPoint(
	XYZ point
)
Public Function OfPoint (
	point As XYZ
) As XYZ
public:
XYZ^ OfPoint(
	XYZ^ point
)
member OfPoint :
        point : XYZ -> XYZ
Parameters
point XYZ
The point to transform.
Return Value
XYZ
The transformed point.
Remarks
 Transformation of a point is affected by the translational part of the transformation.
See Also
Reference
Transform Class
Autodesk.Revit.DB Namespace